УчетВУправляющихДляГит1/src/Documents/КВП_УдалитьУправлениеПарковочнымиМестами/КВП_УдалитьУправлениеПарковочнымиМестами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КВП_УдалитьУправлениеПарковочнымиМестами</name>
  <comment>Помечен на удаление в 3.0.44.2</comment>
  <registerRecords>InformationRegister.Удалить_КВП_СведенияОПарковочныхМестах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.КВП_УдалитьВидыОперацийСПарковочнымМестом</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецПарковочногоМеста</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.УПЖКХ_Жильцы</types>
    </type>
  </attributes>
  <attributes>
    <name>Паркинг</name>
    <type>
      <types>CatalogRef.КВП_Здания</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПарковочныеМеста</name>
    <attributes>
      <name>ПарковочноеМесто</name>
      <type>
        <types>CatalogRef.УПЖКХ_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеМеста</name>
      <type>
        <types>EnumRef.КВП_УдалитьСостояниеПлощади</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/Documents/КВП_УдалитьУправлениеПарковочнымиМестами/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Проведение

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.ВладелецПарковочногоМеста,
	|	Реквизиты.Паркинг,
	|	Реквизиты.Комментарий,
	|	Реквизиты.Ответственный
	|ИЗ
	|	Документ.КВП_УдалитьУправлениеПарковочнымиМестами КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Организация,ВидОперации,ВладелецПарковочногоМеста,
								|Паркинг,Комментарий,Ответственный");
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
